In [1]:
import pandas as pd
import numpy as np

In [2]:
dataset={'price':[110,105,115,120,110,130,150,100,105]
        }

In [3]:
df=pd.DataFrame(dataset)

In [4]:
df

   price
0    110
1    105
2    115
3    120
4    110
5    130
6    150
7    100
8    105

In [5]:
df.head()

   price
0    110
1    105
2    115
3    120
4    110

In [6]:
x=df

In [7]:
x2 = x.copy()

In [8]:
x3=x2.copy()

In [9]:
x4=x3.copy()

In [10]:
x5=x4.copy()

In [11]:
x2.head()

   price
0    110
1    105
2    115
3    120
4    110

# Normalization

In [12]:
from sklearn.preprocessing import MinMaxScaler

In [13]:
m=MinMaxScaler()

In [14]:
df_mar_sp = m.fit(x[['price']]) #calculating
df_mar_sp

MinMaxScaler()

In [15]:
x.head()

   price
0    110
1    105
2    115
3    120
4    110

In [16]:
x['normalization'] = m.fit_transform(x[['price']])

In [17]:
x

   price  normalization
0    110            0.2
1    105            0.1
2    115            0.3
3    120            0.4
4    110            0.2
5    130            0.6
6    150            1.0
7    100            0.0
8    105            0.1

In [18]:
x['price'].min()

100

In [19]:
 x['price'].max()

150

In [20]:
x['normalization'].min()

0.0

In [21]:
x['normalization'].max()

1.0

# Standard Scaler

In [22]:
from sklearn.preprocessing import StandardScaler

In [23]:
m2=StandardScaler()

In [24]:
x2

   price
0    110
1    105
2    115
3    120
4    110
5    130
6    150
7    100
8    105

In [25]:
x2['price'].std()

15.567951410224504

In [26]:
x2['price'].mean()

116.11111111111111

In [27]:
x2['standard'] = m2.fit_transform(x2[['price']])

# Robust

In [28]:
from sklearn.preprocessing import RobustScaler

In [29]:
m3=RobustScaler()

In [30]:
x3['price'].median()

110.0

In [31]:
percentile_25 = np.percentile(x3, 25)

In [32]:
percentile_25

105.0

In [33]:
percentile_75 = np.percentile(x3, 75)

In [34]:
percentile_75

120.0

In [35]:
x3['robust'] = m3.fit_transform(x3[['price']])

In [36]:
x3

   price    robust
0    110  0.000000
1    105 -0.333333
2    115  0.333333
3    120  0.666667
4    110  0.000000
5    130  1.333333
6    150  2.666667
7    100 -0.666667
8    105 -0.333333

# Max Abs

In [37]:
from sklearn.preprocessing import MaxAbsScaler

In [38]:
m4=MaxAbsScaler()

In [39]:
x4['price'].max()

150

In [40]:
x4['max']=m4.fit_transform(x4[['price']])

In [41]:
x4

   price       max
0    110  0.733333
1    105  0.700000
2    115  0.766667
3    120  0.800000
4    110  0.733333
5    130  0.866667
6    150  1.000000
7    100  0.666667
8    105  0.700000

# Log Transformation

In [42]:
x5

   price
0    110
1    105
2    115
3    120
4    110
5    130
6    150
7    100
8    105

In [43]:
#log_transform = np.log(x5['price'])

In [44]:
#x5['log_transform']=log_transform

In [45]:
#x5

In [46]:
log_base_10 = np.log(x5[['price']]) / np.log(10)

In [47]:
x5['log_base_10 '] = log_base_10

In [48]:
x5

   price  log_base_10
0    110      2.041393
1    105      2.021189
2    115      2.060698
3    120      2.079181
4    110      2.041393
5    130      2.113943
6    150      2.176091
7    100      2.000000
8    105      2.021189